/*
محصولات یک فروشگاه انلاین را در دیتابس ذخیره کرده و ارایه ای برای سبد خرید کاربر داشته باشید 
و از کاربر اسم محصولی را که قصد اضافه کردن به سبد خرید دارد دریافت کنید
اگر محصول درخواستی کاربر به انبار فروشگاه شما موجود بود آن را به سبد خرید کاربر اضافهکنید
و سپس مبلغ کل سبد خرید را محاسبه کرده و به کاربر نمایش دهید
درغیر این صورت به کاربر پیغام اتمام موجودی نمایش دهید
نکته
بعد از اضافه محصول به سبد خرید سبد را در کنسول نمایش دهید
به طور دیفات 3 محصول با قیمت های مختلف به سلد خرید کاربر موجود باشد

*/
